#include <iostream>
#include <stdio.h>
#include <conio.h>
//Т.А. Павловская, Ю.А. Щупак
//С/С++ Структурное программирование. Практикум
//Семинар 2. Разветвляющиеся программы. Циклы.
//Задача 2.3. Таблица значений функции.
//Написать программу печати таблицы значений функции
//    t , x < 0
//y = tx, 0 <= x < 10
//    2t, x >= 10
//для аргумента, изменяющегося в заданных пределах с заданным шагом. Если 
//t>100, должны выводиться целые значения функции

using namespace std;

int main()
{
	setlocale(LC_ALL, "Ru");
	
	return 0;
}



